// Топ-10 студентов по курсам

const courseSummary = [
  {
    id: 0,
    group: "И1.24-22",
    name: "Алдамов М.",
    gpa: 224.04,
  },
  {
    id: 1,
    group: "И1.24-22",
    name: "Шахабова Х.",
    gpa: 195.75,
  },
  {
    id: 2,
    group: "И1.24-21",
    name: "Шугаипова Х.",
    gpa: 191.52,
  },
  {
    id: 3,
    group: "И1.23-32",
    name: "Эльмурзаев С.",
    gpa: 156.16,
  },
  {
    id: 4,
    group: "О1.24-21",
    name: "Абубакирова Э.",
    gpa: 155.86,
  },
  {
    id: 5,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 154.96,
  },
  {
    id: 6,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 153.70,
  },
  {
    id: 7,
    group: "О2.24-21",
    name: "Садаев И.",
    gpa: 152.19,
  },
  {
    id: 8,
    group: "И1.23-33",
    name: "Абасов А.",
    gpa: 152.00,
  },
  {
    id: 9,
    group: "И1.23-33",
    name: "Яхъяев М.",
    gpa: 147.09,
  },
];

const course4 = [
  {
    id: 0,
    group: "И1.22-43",
    name: "Самадов Р.",
    gpa: 117.15,
  },
  {
    id: 1,
    group: "И1.22-43",
    name: "Вашаев С.",
    gpa: 105.53,
  },
  {
    id: 2,
    group: "И1.22-44",
    name: "Баталов Р.",
    gpa: 100.73,
  },
  {
    id: 3,
    group: "И1.22-42",
    name: "Мадаев С.",
    gpa: 100.62,
  },
  {
    id: 4,
    group: "И1.22-41",
    name: "Расулов Х.",
    gpa: 99.96,
  },
  {
    id: 5,
    group: "И1.22-44",
    name: "Межидов М.",
    gpa: 99.73,
  },
  {
    id: 6,
    group: "И1.22-41",
    name: "Лутушева С.",
    gpa: 99.47,
  },
  {
    id: 7,
    group: "И1.22-44",
    name: "Бадаев Р.",
    gpa: 98.24,
  },
  {
    id: 8,
    group: "И1.22-44",
    name: "Пициев М.",
    gpa: 96.58,
  },
  {
    id: 9,
    group: "И1.22-43",
    name: "Гашлуев А.",
    gpa: 92.43,
  },
];

const course3 = [
  {
    id: 0,
    group: "И1.23-32",
    name: "Эльмурзаев С.",
    gpa: 156.16,
  },
  {
    id: 1,
    group: "И1.23-33",
    name: "Абасов А.",
    gpa: 152.00,
  },
  {
    id: 2,
    group: "И1.23-33",
    name: "Яхъяев М.",
    gpa: 147.09,
  },
  {
    id: 3,
    group: "Э3.23-31",
    name: "Астемирова Х.",
    gpa: 135.85,
  },
  {
    id: 4,
    group: "СР1.23-31",
    name: "Кукуева А.",
    gpa: 132.52,
  },
  {
    id: 5,
    group: "И1.23-31",
    name: "Эзерханов А.",
    gpa: 123.40,
  },
  {
    id: 6,
    group: "Э3.23-31",
    name: "Сапарова Я.",
    gpa: 121.46,
  },
  {
    id: 7,
    group: "И1.23-31",
    name: "Исраилов И.",
    gpa: 121.05,
  },
  {
    id: 8,
    group: "И2.23-31",
    name: "Дахнаев Р.",
    gpa: 120.59,
  },
  {
    id: 9,
    group: "И1.23-31",
    name: "Висханов А.",
    gpa: 119.30,
  },
];

const course2 = [
  {
    id: 0,
    group: "И1.24-22",
    name: "Алдамов М.",
    gpa: 224.04,
  },
  {
    id: 1,
    group: "И1.24-22",
    name: "Шахабова Х.",
    gpa: 195.75,
  },
  {
    id: 2,
    group: "И1.24-21",
    name: "Шугаипова Х.",
    gpa: 191.52,
  },
  {
    id: 3,
    group: "О1.24-21",
    name: "Абубакирова Э.",
    gpa: 155.86,
  },
  {
    id: 4,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 154.96,
  },
  {
    id: 5,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 153.70,
  },
  {
    id: 6,
    group: "О2.24-21",
    name: "Садаев И.",
    gpa: 152.19,
  },
  {
    id: 7,
    group: "О1.24-22",
    name: "Заурбекова К.",
    gpa: 145.28,
  },
  {
    id: 8,
    group: "И1.24-22",
    name: "Халибекова Ф.",
    gpa: 142.90,
  },
  {
    id: 9,
    group: "ИБ1.24-21",
    name: "Тутаев Р.",
    gpa: 141.43,
  },
];

const course1 = [
  {
    id: 0,
    group: "СР1.25-12",
    name: "Сулейманова П.",
    gpa: 143.74,
  },
  {
    id: 1,
    group: "И1.25-14",
    name: "Дашаева С.",
    gpa: 138.46,
  },
  {
    id: 2,
    group: "Э1.25-11",
    name: "Никаева М.",
    gpa: 136.38,
  },
  {
    id: 3,
    group: "И1.25-11",
    name: "Муциева Л.",
    gpa: 133.29,
  },
  {
    id: 4,
    group: "И1.25-13",
    name: "Заурбекова А.",
    gpa: 133.04,
  },
  {
    id: 5,
    group: "Э1.25-11",
    name: "Эльмурзаева К.",
    gpa: 130.18,
  },
  {
    id: 6,
    group: "О6.25-11",
    name: "Бешиева А.",
    gpa: 129.58,
  },
  {
    id: 7,
    group: "Э1.25-12",
    name: "Кагерманова Э.",
    gpa: 126.52,
  },
  {
    id: 8,
    group: "СР1.25-12",
    name: "Мисирова С.",
    gpa: 122.14,
  },
  {
    id: 9,
    group: "И1.25-12",
    name: "Бисултанов Д.",
    gpa: 121.95,
  },
];

