// Топ-10 студентов по курсам

const courseSummary = [
  {
    id: 0,
    group: "И1.24-22",
    name: "Алдамов М.",
    gpa: 443.26,
  },
  {
    id: 1,
    group: "И1.24-22",
    name: "Шахабова Х.",
    gpa: 376.27,
  },
  {
    id: 2,
    group: "И1.24-21",
    name: "Шугаипова Х.",
    gpa: 371.76,
  },
  {
    id: 3,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 297.00,
  },
  {
    id: 4,
    group: "О1.24-21",
    name: "Абубакирова Э.",
    gpa: 296.97,
  },
  {
    id: 5,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 287.69,
  },
  {
    id: 6,
    group: "О2.24-21",
    name: "Садаев И.",
    gpa: 283.19,
  },
  {
    id: 7,
    group: "И1.23-32",
    name: "Эльмурзаев С.",
    gpa: 275.22,
  },
  {
    id: 8,
    group: "И1.23-33",
    name: "Абасов А.",
    gpa: 273.60,
  },
  {
    id: 9,
    group: "О1.24-22",
    name: "Заурбекова К.",
    gpa: 272.66,
  },
];

const course4 = [
  {
    id: 0,
    group: "И1.22-43",
    name: "Самадов Р.",
    gpa: 211.91,
  },
  {
    id: 1,
    group: "И1.22-41",
    name: "Расулов Х.",
    gpa: 178.62,
  },
  {
    id: 2,
    group: "И1.22-43",
    name: "Вашаев С.",
    gpa: 176.70,
  },
  {
    id: 3,
    group: "И1.22-44",
    name: "Межидов М.",
    gpa: 176.09,
  },
  {
    id: 4,
    group: "И1.22-44",
    name: "Баталов Р.",
    gpa: 175.17,
  },
  {
    id: 5,
    group: "И1.22-41",
    name: "Лутушева С.",
    gpa: 171.94,
  },
  {
    id: 6,
    group: "И1.22-42",
    name: "Мадаев С.",
    gpa: 171.72,
  },
  {
    id: 7,
    group: "И1.22-44",
    name: "Бадаев Р.",
    gpa: 168.80,
  },
  {
    id: 8,
    group: "И1.22-44",
    name: "Пициев М.",
    gpa: 168.66,
  },
  {
    id: 9,
    group: "И1.22-41",
    name: "Хадисова Т.",
    gpa: 152.70,
  },
];

const course3 = [
  {
    id: 0,
    group: "И1.23-32",
    name: "Эльмурзаев С.",
    gpa: 275.22,
  },
  {
    id: 1,
    group: "И1.23-33",
    name: "Абасов А.",
    gpa: 273.60,
  },
  {
    id: 2,
    group: "И1.23-33",
    name: "Яхъяев М.",
    gpa: 264.09,
  },
  {
    id: 3,
    group: "СР1.23-31",
    name: "Кукуева А.",
    gpa: 252.43,
  },
  {
    id: 4,
    group: "Э3.23-31",
    name: "Астемирова Х.",
    gpa: 249.68,
  },
  {
    id: 5,
    group: "Э3.23-31",
    name: "Сапарова Я.",
    gpa: 224.23,
  },
  {
    id: 6,
    group: "И1.23-31",
    name: "Висханов А.",
    gpa: 213.75,
  },
  {
    id: 7,
    group: "И1.23-31",
    name: "Эзерханов А.",
    gpa: 212.13,
  },
  {
    id: 8,
    group: "СР1.23-31",
    name: "Гайсумова С.",
    gpa: 209.68,
  },
  {
    id: 9,
    group: "СР1.23-32",
    name: "Сагаева С.",
    gpa: 209.68,
  },
];

const course2 = [
  {
    id: 0,
    group: "И1.24-22",
    name: "Алдамов М.",
    gpa: 443.26,
  },
  {
    id: 1,
    group: "И1.24-22",
    name: "Шахабова Х.",
    gpa: 376.27,
  },
  {
    id: 2,
    group: "И1.24-21",
    name: "Шугаипова Х.",
    gpa: 371.76,
  },
  {
    id: 3,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 297.00,
  },
  {
    id: 4,
    group: "О1.24-21",
    name: "Абубакирова Э.",
    gpa: 296.97,
  },
  {
    id: 5,
    group: "И1.24-23",
    name: "Хасанов М.",
    gpa: 287.69,
  },
  {
    id: 6,
    group: "О2.24-21",
    name: "Садаев И.",
    gpa: 283.19,
  },
  {
    id: 7,
    group: "О1.24-22",
    name: "Заурбекова К.",
    gpa: 272.66,
  },
  {
    id: 8,
    group: "И1.24-22",
    name: "Халибекова Ф.",
    gpa: 257.55,
  },
  {
    id: 9,
    group: "ИБ1.24-21",
    name: "Тутаев Р.",
    gpa: 256.67,
  },
];

const course1 = [
  {
    id: 0,
    group: "СР1.25-12",
    name: "Сулейманова П.",
    gpa: 244.89,
  },
  {
    id: 1,
    group: "И1.25-14",
    name: "Дашаева С.",
    gpa: 235.51,
  },
  {
    id: 2,
    group: "И1.25-11",
    name: "Муциева Л.",
    gpa: 234.41,
  },
  {
    id: 3,
    group: "Э1.25-11",
    name: "Никаева М.",
    gpa: 233.44,
  },
  {
    id: 4,
    group: "И1.25-13",
    name: "Заурбекова А.",
    gpa: 230.32,
  },
  {
    id: 5,
    group: "Э1.25-11",
    name: "Эльмурзаева К.",
    gpa: 227.13,
  },
  {
    id: 6,
    group: "О6.25-11",
    name: "Бешиева А.",
    gpa: 226.42,
  },
  {
    id: 7,
    group: "Э1.25-12",
    name: "Кагерманова Э.",
    gpa: 210.11,
  },
  {
    id: 8,
    group: "И1.25-12",
    name: "Бисултанов Д.",
    gpa: 203.65,
  },
  {
    id: 9,
    group: "И1.25-12",
    name: "Галаев И.",
    gpa: 201.98,
  },
];

