package config

// Coefficients содержит коэффициенты для расчетов
var (
	// Коэффициенты для подсчета сумм
	SumCoefficients = [4]float64{5, 4, 4, 5}
	
	// Коэффициенты для средневзвешенной оценки
	WeightCoefficients = [4]float64{5, 4, 3, 2}
	
	// Границы диапазона игнорирования avgGrade
	IgnoreRangeMin = 3.9
	IgnoreRangeMax = 4.1
	
	// Делитель для финальной оценки
	FinalGradeDivisor = 7.0
)

// SheetNames содержит названия листов Excel
var SheetNames = []string{"Сводка", "4 курс", "3 курс", "2 курс", "1 курс"}

// CourseMapping содержит маппинг номеров групп на курсы
var CourseMapping = map[string]string{
	"22": "4 курс",
	"23": "3 курс",
	"24": "2 курс",
	"25": "1 курс",
}

// CourseJSNames содержит названия переменных для JavaScript экспорта
var CourseJSNames = map[string]string{
	"1 курс": "course1",
	"2 курс": "course2",
	"3 курс": "course3",
	"4 курс": "course4",
	"Сводка": "courseSummary",
}

// Files содержит список файлов для обработки
var Files = []string{
	"Б1.23-31.xls",
	"БАС1.24-21.xls",
	"БАС1.25-11.xls",
	"И1.22-41.xls",
	"И1.22-42.xls",
	"И1.22-43.xls",
	"И1.22-44.xls",
	"И1.23-31.xls",
	"И1.23-32.xls",
	"И1.23-33.xls",
	"И1.24-21.xls",
	"И1.24-22.xls",
	"И1.24-23.xls",
	"И1.25-11.xls",
	"И1.25-12.xls",
	"И1.25-13.xls",
	"И1.25-14.xls",
	"И2.22-41.xls",
	"И2.23-31.xls",
	"И2.24-21.xls",
	"И2.25-11.xls",
	"И2.25-12.xls",
	"ИБ1.24-21.xls",
	"ИБ1.25-11.xls",
	"О1.24-21.xls",
	"О1.24-22.xls",
	"О1.24-23.xls",
	"О1.25-11.xls",
	"О1.25-12.xls",
	"О1.25-13.xls",
	"О2.24-21.xls",
	"О2.25-11.xls",
	"О2.25-12.xls",
	"О5.25-11.xls",
	"О6.25-11.xls",
	"О6.25-12.xls",
	"С1.22-41.xls",
	"С1.23-31.xls",
	"С1.24-21.xls",
	"С1.25-11.xls",
	"СР1.23-31.xls",
	"СР1.23-32.xls",
	"СР1.24-21.xls",
	"СР1.24-22.xls",
	"СР1.25-11.xls",
	"СР1.25-12.xls",
	"Э1.23-31.xls",
	"Э1.23-32.xls",
	"Э1.24-21.xls",
	"Э1.24-22.xls",
	"Э1.25-11.xls",
	"Э1.25-12.xls",
	"Э3.23-31.xls",
}
